witalis3/UA3REO-DDC-Transceiver/STM32/Src/usbd_ua3reo.c
#include "usb_device.h"
#include "usbd_ua3reo.h"
#include "usbd_audio_if.h"
#include "usbd_iq_if.h"
#include "usbd_ctlreq.h"
#include "functions.h"
#include "wm8731.h"
#include "lcd_driver.h"
#include "stm32h7xx_ll_usb.h"

static uint8_t USBD_UA3REO_Init(USBD_HandleTypeDef *pdev);
static uint8_t USBD_UA3REO_DeInit(USBD_HandleTypeDef *pdev);
static uint8_t USBD_UA3REO_Setup(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req);
static uint8_t USBD_UA3REO_DataIn(USBD_HandleTypeDef *pdev, uint8_t epnum);
static uint8_t USBD_UA3REO_DataOut(USBD_HandleTypeDef *pdev, uint8_t epnum);
static uint8_t USBD_UA3REO_EP0_RxReady(USBD_HandleTypeDef *pdev);
static uint8_t USBD_UA3REO_EP0_TxReady(void);
static uint8_t USBD_UA3REO_SOF(void);
static uint8_t USBD_UA3REO_IsoINIncomplete(void);
static uint8_t USBD_UA3REO_IsoOutIncomplete(void);
static void AUDIO_REQ_GetCurrent(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req);
static void AUDIO_REQ_SetCurrent(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req);
static void IQ_REQ_GetCurrent(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req);
static void IQ_REQ_SetCurrent(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req);
static const uint8_t *USBD_UA3REO_GetFSCfgDesc(uint16_t *length);
static const uint8_t *USBD_UA3REO_GetDeviceQualifierDescriptor(uint16_t *length);

static uint16_t rx_audio_buffer_head = 0;
static uint16_t rx_audio_buffer_step = 0;
static uint16_t rx_iq_buffer_head = 0;
static uint16_t rx_iq_buffer_step = 0;

volatile bool RX_USB_AUDIO_underrun = false;
volatile uint32_t RX_USB_AUDIO_SAMPLES = 0;
volatile uint32_t TX_USB_AUDIO_SAMPLES = 0;
volatile uint32_t RX_USB_IQ_SAMPLES = 0;
volatile uint32_t TX_USB_IQ_SAMPLES = 0;
volatile uint32_t USB_LastActiveTime = 0;

/* USB Standard Device Descriptor */
__ALIGN_BEGIN static const uint8_t USBD_UA3REO_DeviceQualifierDesc[USB_LEN_DEV_QUALIFIER_DESC] __ALIGN_END =
	{
		USB_LEN_DEV_QUALIFIER_DESC,
		USB_DESC_TYPE_DEVICE_QUALIFIER,
		0x00,
		0x02,
		0x00,
		0x00,
		0x00,
		0x40,
		0x01,
		0x00,
};

/* UA3REO interface class callbacks structure */
USBD_ClassTypeDef USBD_UA3REO =
	{
		USBD_UA3REO_Init,
		USBD_UA3REO_DeInit,
		USBD_UA3REO_Setup,
		USBD_UA3REO_EP0_TxReady,
		USBD_UA3REO_EP0_RxReady,
		USBD_UA3REO_DataIn,
		USBD_UA3REO_DataOut,
		USBD_UA3REO_SOF,
		USBD_UA3REO_IsoINIncomplete,
		USBD_UA3REO_IsoOutIncomplete,
		NULL,
		USBD_UA3REO_GetFSCfgDesc,
		NULL,
		USBD_UA3REO_GetDeviceQualifierDescriptor,
};

/* USB CDC device Configuration Descriptor */
__ALIGN_BEGIN static const uint8_t USBD_UA3REO_CfgFSDesc[USB_CDC_CONFIG_DESC_SIZ] __ALIGN_END =
	{
		/*Configuration Descriptor*/
		0x09,							  /* bLength: Configuration Descriptor size */
		USB_DESC_TYPE_CONFIGURATION,	  /* bDescriptorType: Configuration */
		(USB_CDC_CONFIG_DESC_SIZ & 0xFF), /* wTotalLength:no of returned bytes */
		USB_CDC_CONFIG_DESC_SIZ >> 8,
		0x0A, /* bNumInterfaces: count interface */
		0x01, /* bConfigurationValue: Configuration value */
		0x00, /* iConfiguration: Index of string descriptor describing the configuration */
		0xC0, /* bmAttributes: self powered */
		0xFA, /* MaxPower 500 mA */

		//---------------------------------------------------------------------------
		// DEBUG/KEY PORT
		// Interface Association Descriptor:
		//------------------------------
		0x08,					 // bLength
		0x0B,					 // bDescriptorType
		0x00,					 // bFirstInterface
		0x02,					 // bInterfaceCount
		0x02,					 // bFunctionClass      (Communication Device Class)
		0x02,					 // bFunctionSubClass   (Abstract Control Model - ACM)
		0x01,					 // bFunctionProtocol   (ITU-T V.250)
		USBD_IDX_INTERFACE1_STR, // iFunction   ""

		/*Interface Descriptor */
		0x09,					 /* bLength: Interface Descriptor size */
		USB_DESC_TYPE_INTERFACE, /* bDescriptorType: Interface */
		/* Interface descriptor type */
		DEBUG_INTERFACE_IDX,	 /* bInterfaceNumber: Number of Interface */
		0x00,					 /* bAlternateSetting: Alternate setting */
		0x01,					 /* bNumEndpoints: One endpoints used */
		0x02,					 /* bInterfaceClass: Communication Interface Class */
		0x02,					 /* bInterfaceSubClass: Abstract Control Model */
		0x01,					 /* bInterfaceProtocol: Common AT commands */
		USBD_IDX_INTERFACE1_STR, /* iInterface: */

		/*Header Functional Descriptor*/
		0x05, /* bLength: Endpoint Descriptor size */
		0x24, /* bDescriptorType: CS_INTERFACE */
		0x00, /* bDescriptorSubtype: Header Func Desc */
		0x10, /* bcdCDC: spec release number */
		0x01,

		/*Call Management Functional Descriptor*/
		0x05, /* bFunctionLength */
		0x24, /* bDescriptorType: CS_INTERFACE */
		0x01, /* bDescriptorSubtype: Call Management Func Desc */
		0x00, /* bmCapabilities: D0+D1 */
		0x01, /* bDataInterface: 1 */

		/*ACM Functional Descriptor*/
		0x04, /* bFunctionLength */
		0x24, /* bDescriptorType: CS_INTERFACE */
		0x02, /* bDescriptorSubtype: Abstract Control Management desc */
		0x02, /* bmCapabilities */

		/*Union Functional Descriptor*/
		0x05, /* bFunctionLength */
		0x24, /* bDescriptorType: CS_INTERFACE */
		0x06, /* bDescriptorSubtype: Union func desc */
		0x00, /* bMasterInterface: Communication class interface */
		0x01, /* bSlaveInterface0: Data Class Interface */

		//---------------------------------------------------------------------------

		/*Endpoint CMD Descriptor*/
		0x07,						 /* bLength: Endpoint Descriptor size */
		USB_DESC_TYPE_ENDPOINT,		 /* bDescriptorType: Endpoint */
		DEBUG_CMD_EP,				 /* bEndpointAddress */
		0x03,						 /* bmAttributes: Interrupt */
		LOBYTE(CDC_CMD_PACKET_SIZE), /* wMaxPacketSize: */
		HIBYTE(CDC_CMD_PACKET_SIZE),
		0x10, /* bInterval: */

		/*Data class interface descriptor*/
		0x09,					   /* bLength: Endpoint Descriptor size */
		USB_DESC_TYPE_INTERFACE,   /* bDescriptorType: */
		(DEBUG_INTERFACE_IDX + 1), /* bInterfaceNumber: Number of Interface */
		0x00,					   /* bAlternateSetting: Alternate setting */
		0x02,					   /* bNumEndpoints: Two endpoints used */
		0x0A,					   /* bInterfaceClass: CDC */
		0x00,					   /* bInterfaceSubClass: */
		0x00,					   /* bInterfaceProtocol: */
		USBD_IDX_INTERFACE1_STR,   /* iInterface: */

		/*Endpoint OUT Descriptor*/
		0x07,								 /* bLength: Endpoint Descriptor size */
		USB_DESC_TYPE_ENDPOINT,				 /* bDescriptorType: Endpoint */
		DEBUG_OUT_EP,						 /* bEndpointAddress */
		0x02,								 /* bmAttributes: Bulk */
		LOBYTE(CDC_DATA_FS_MAX_PACKET_SIZE), /* wMaxPacketSize: */
		HIBYTE(CDC_DATA_FS_MAX_PACKET_SIZE),
		0x01, /* bInterval: ignore for Bulk transfer */

