witalis3/UA3REO-DDC-Transceiver/STM32/Src/usbd_ua3reo.c
		/*Endpoint IN Descriptor*/
		0x07,								 /* bLength: Endpoint Descriptor size */
		USB_DESC_TYPE_ENDPOINT,				 /* bDescriptorType: Endpoint */
		DEBUG_IN_EP,						 /* bEndpointAddress */
		0x02,								 /* bmAttributes: Bulk */
		LOBYTE(CDC_DATA_FS_MAX_PACKET_SIZE), /* wMaxPacketSize: */
		HIBYTE(CDC_DATA_FS_MAX_PACKET_SIZE),
		0x01, /* bInterval: ignore for Bulk transfer */

		//---------------------------------------------------------------------------

		// CAT PORT
		// Interface Association Descriptor:
		//------------------------------
		0x08,					 // bLength
		0x0B,					 // bDescriptorType
		0x02,					 // bFirstInterface
		0x02,					 // bInterfaceCount
		0x02,					 // bFunctionClass      (Communication Device Class)
		0x02,					 // bFunctionSubClass   (Abstract Control Model - ACM)
		0x01,					 // bFunctionProtocol   (ITU-T V.250)
		USBD_IDX_INTERFACE2_STR, // iFunction   ""

		/*Interface Descriptor */
		0x09,					 /* bLength: Interface Descriptor size */
		USB_DESC_TYPE_INTERFACE, /* bDescriptorType: Interface */
		/* Interface descriptor type */
		CAT_INTERFACE_IDX,		 /* bInterfaceNumber: Number of Interface */
		0x00,					 /* bAlternateSetting: Alternate setting */
		0x01,					 /* bNumEndpoints: One endpoints used */
		0x02,					 /* bInterfaceClass: Communication Interface Class */
		0x02,					 /* bInterfaceSubClass: Abstract Control Model */
		0x01,					 /* bInterfaceProtocol: Common AT commands */
		USBD_IDX_INTERFACE2_STR, /* iInterface: */

		/*Header Functional Descriptor*/
		0x05, /* bLength: Endpoint Descriptor size */
		0x24, /* bDescriptorType: CS_INTERFACE */
		0x00, /* bDescriptorSubtype: Header Func Desc */
		0x10, /* bcdCDC: spec release number */
		0x01,

		/*Call Management Functional Descriptor*/
		0x05, /* bFunctionLength */
		0x24, /* bDescriptorType: CS_INTERFACE */
		0x01, /* bDescriptorSubtype: Call Management Func Desc */
		0x00, /* bmCapabilities: D0+D1 */
		0x03, /* bDataInterface: 1 */

		/*ACM Functional Descriptor*/
		0x04, /* bFunctionLength */
		0x24, /* bDescriptorType: CS_INTERFACE */
		0x02, /* bDescriptorSubtype: Abstract Control Management desc */
		0x02, /* bmCapabilities */

		/*Union Functional Descriptor*/
		0x05, /* bFunctionLength */
		0x24, /* bDescriptorType: CS_INTERFACE */
		0x06, /* bDescriptorSubtype: Union func desc */
		0x02, /* bMasterInterface: Communication class interface */
		0x03, /* bSlaveInterface0: Data Class Interface */

		//---------------------------------------------------------------------------

		/*Endpoint CMD Descriptor*/
		0x07,						 /* bLength: Endpoint Descriptor size */
		USB_DESC_TYPE_ENDPOINT,		 /* bDescriptorType: Endpoint */
		CAT_CMD_EP,					 /* bEndpointAddress */
		0x03,						 /* bmAttributes: Interrupt */
		LOBYTE(CDC_CMD_PACKET_SIZE), /* wMaxPacketSize: */
		HIBYTE(CDC_CMD_PACKET_SIZE),
		0x10, /* bInterval: */

		/*Data class interface descriptor*/
		0x09,					 /* bLength: Endpoint Descriptor size */
		USB_DESC_TYPE_INTERFACE, /* bDescriptorType: */
		(CAT_INTERFACE_IDX + 1), /* bInterfaceNumber: Number of Interface */
		0x00,					 /* bAlternateSetting: Alternate setting */
		0x02,					 /* bNumEndpoints: Two endpoints used */
		0x0A,					 /* bInterfaceClass: CDC */
		0x00,					 /* bInterfaceSubClass: */
		0x00,					 /* bInterfaceProtocol: */
		USBD_IDX_INTERFACE2_STR, /* iInterface: */

		/*Endpoint OUT Descriptor*/
		0x07,								 /* bLength: Endpoint Descriptor size */
		USB_DESC_TYPE_ENDPOINT,				 /* bDescriptorType: Endpoint */
		CAT_OUT_EP,							 /* bEndpointAddress */
		0x02,								 /* bmAttributes: Bulk */
		LOBYTE(CDC_DATA_FS_MAX_PACKET_SIZE), /* wMaxPacketSize: */
		HIBYTE(CDC_DATA_FS_MAX_PACKET_SIZE),
		0x01, /* bInterval: ignore for Bulk transfer */

		/*Endpoint IN Descriptor*/
		0x07,								 /* bLength: Endpoint Descriptor size */
		USB_DESC_TYPE_ENDPOINT,				 /* bDescriptorType: Endpoint */
		CAT_IN_EP,							 /* bEndpointAddress */
		0x02,								 /* bmAttributes: Bulk */
		LOBYTE(CDC_DATA_FS_MAX_PACKET_SIZE), /* wMaxPacketSize: */
		HIBYTE(CDC_DATA_FS_MAX_PACKET_SIZE),
		0x01, /* bInterval: ignore for Bulk transfer */

		//---------------------------------------------------------------------------

		// AUDIO RX PORT
		// Interface Association Descriptor:
		//------------------------------
		0x08,					 //     bLength
		0x0B,					 //    bDescriptorType
		0x04,					 //     bFirstInterface
		0x03,					 //     bInterfaceCount
		0x01,					 //     bFunctionClass      (Audio Device Class)
		0x00,					 //     bFunctionSubClass
		0x00,					 //     bFunctionProtocol
		USBD_IDX_INTERFACE3_STR, //     iFunction   "UA3REO Transceiver AUDIO RX"

		// Interface Descriptor (Control):
		//------------------------------
		0x09,					 //     bLength
		0x04,					 //     bDescriptorType
		AUDIO_INTERFACE_IDX,	 //     bInterfaceNumber
		0x00,					 //     bAlternateSetting
		0x00,					 //     bNumEndPoints
		0x01,					 //     bInterfaceClass      (Audio Device Class)
		0x01,					 //     bInterfaceSubClass   (Audio Control Interface)
		0x00,					 //     bInterfaceProtocol
		USBD_IDX_INTERFACE3_STR, //     iInterface   ""

		// AC Interface Header Descriptor (Control):
		//------------------------------
		0x0A, //     bLength
		0x24, //     bDescriptorType
		0x01, //     bDescriptorSubtype
		0x00, //
		0x01, // bcdADC
		0x34, // wTotalLength   (52 bytes)
		0x00, // wTotalLength
		0x02, //     bInCollection
		0x05, //     baInterfaceNr(1)
		0x06, //     baInterfaceNr(2)

		// AC Input Terminal Descriptor (Microphone):
		//------------------------------
		0x0C, //    bLength
		0x24, //     bDescriptorType
		0x02, //     bDescriptorSubtype
		0x1E, //    bTerminalID
		0x10, // wTerminalType   (Radio Receiver)
		0x07, // wTerminalType   (Radio Receiver)
		0x00, //     bAssocTerminal
		0x02, //     bNrChannels   (2 channels)
		0x03, // wChannelConfig
		0x00, // wChannelConfig
		0x00, //    iChannelNames
		0x00, //     iTerminal

