witalis3/UA3REO-DDC-Transceiver/STM32/Src/usbd_ua3reo.c
		// AC Output Terminal Descriptor (Microphone):
		//------------------------------
		0x09, //     bLength
		0x24, //     bDescriptorType
		0x03, //     bDescriptorSubtype
		0x23, //     bTerminalID
		0x01, // wTerminalType   (USB Streaming)
		0x01, // wTerminalType   (USB Streaming)
		0x00, //     bAssocTerminal
		0x1E, //    bSourceID
		0x00, //     iTerminal   "wwww 1"

		// AC Input Terminal Descriptor (Speaker):
		//------------------------------
		0x0C, //    bLength
		0x24, //     bDescriptorType
		0x02, //     bDescriptorSubtype
		0x0C, //    bTerminalID
		0x01, // wTerminalType   (USB Streaming)
		0x01, // wTerminalType   (USB Streaming)
		0x00, //     bAssocTerminal
		0x02, //     bNrChannels   (2 channels)
		0x03, // wChannelConfig
		0x00, // wChannelConfig
		0x1B, //    iChannelNames
		0x00, //    iTerminal   "eeee 3"

		// AC Output Terminal Descriptor (Speaker):
		//------------------------------
		0x09, //     bLength
		0x24, //     bDescriptorType
		0x03, //     bDescriptorSubtype
		0x11, //     bTerminalID
		0x11, // wTerminalType   (Radio Transmitter)
		0x07, // wTerminalType   (Radio Transmitter)
		0x00, //     bAssocTerminal
		0x0C, //    bSourceID
		0x00, //     iTerminal

		// Interface Descriptor (Microphone):
		//------------------------------
		0x09,					   //     bLength
		0x04,					   //     bDescriptorType
		(AUDIO_INTERFACE_IDX + 1), //     bInterfaceNumber
		0x00,					   //     bAlternateSetting
		0x00,					   //     bNumEndPoints
		0x01,					   //     bInterfaceClass      (Audio Device Class)
		0x02,					   //     bInterfaceSubClass   (Audio Streaming Interface)
		0x00,					   //     bInterfaceProtocol
		USBD_IDX_INTERFACE3_STR,   //     iInterface   "xxxx 1"

		// Interface Descriptor (Microphone):
		//------------------------------
		0x09,					   //     bLength
		0x04,					   //     bDescriptorType
		(AUDIO_INTERFACE_IDX + 1), //     bInterfaceNumber
		0x01,					   //     bAlternateSetting
		0x01,					   //     bNumEndPoints
		0x01,					   //     bInterfaceClass      (Audio Device Class)
		0x02,					   //     bInterfaceSubClass   (Audio Streaming Interface)
		0x00,					   //     bInterfaceProtocol
		USBD_IDX_INTERFACE3_STR,   //     iInterface   "xxxx 1"

		// AS Interface Descriptor (Microphone):
		//------------------------------
		0x07, //     bLength
		0x24, //     bDescriptorType
		0x01, //     bDescriptorSubtype
		0x23, //     bTerminalLink
		0x01, //     bDelay
		0x01, // wFormatTag   (PCM)
		0x00, // wFormatTag   (PCM)

		// AS Format Type 1 Descriptor (Microphone):
		//------------------------------
		0x0B, //    bLength
		0x24, //     bDescriptorType
		0x02, //     bDescriptorSubtype
		0x01, //     bFormatType   (FORMAT_TYPE_1)
		0x02, //     bNrChannels   (2 channels)
		0x03, //     bSubframeSize
		0x18, //     bBitResolution   (24 bits per sample)
		0x01, //     bSamFreqType   (Discrete sampling frequencies)
		0x80, //         tSamFreq(1)   (48000 Hz)
		0xBB, //         tSamFreq(1)   (48000 Hz)
		0x00, //         tSamFreq(1)   (48000 Hz)

		// Endpoint Descriptor (Audio/MIDI 1.0) (Microphone):
		//------------------------------
		0x09,					  //     bLength
		0x05,					  //     bDescriptorType
		AUDIO_IN_EP,			  //     bEndpointAddress  (IN endpoint 1)
		0x0D,					  //     bmAttributes      (Transfer: Isochronous / Synch: Synchronous / Usage: Data)
		LOBYTE(AUDIO_OUT_PACKET), /* wMaxPacketSize: */
		HIBYTE(AUDIO_OUT_PACKET),
		0x01, //     bInterval         (1 frames)
		0x00, //     bRefresh
		0x00, //     bSynchAddress

		// AS Isochronous Data Endpoint Descriptor (Microphone):
		//------------------------------
		0x07, //     bLength
		0x25, //     bDescriptorType
		0x01, //     bDescriptorSubtype
		0x00, //     bmAttributes
		0x02, //     bLockDelayUnits   (decoded PCM samples)
		0x00, // wLockDelay
		0x00, // wLockDelay

		// Interface Descriptor (Speaker):
		//------------------------------
		0x09,					   //     bLength
		0x04,					   //     bDescriptorType
		(AUDIO_INTERFACE_IDX + 2), //     bInterfaceNumber
		0x00,					   //     bAlternateSetting
		0x00,					   //     bNumEndPoints
		0x01,					   //     bInterfaceClass      (Audio Device Class)
		0x02,					   //     bInterfaceSubClass   (Audio Streaming Interface)
		0x00,					   //     bInterfaceProtocol
		USBD_IDX_INTERFACE3_STR,   //     iInterface   "yyyy 3"

		// Interface Descriptor (Speaker):
		//------------------------------
		0x09,					   //     bLength
		0x04,					   //     bDescriptorType
		(AUDIO_INTERFACE_IDX + 2), //     bInterfaceNumber
		0x01,					   //     bAlternateSetting
		0x01,					   //     bNumEndPoints
		0x01,					   //     bInterfaceClass      (Audio Device Class)
		0x02,					   //     bInterfaceSubClass   (Audio Streaming Interface)
		0x00,					   //     bInterfaceProtocol
		USBD_IDX_INTERFACE3_STR,   //    iInterface   "zzzz 3"

		// AS Interface Descriptor (Speaker):
		//------------------------------
		0x07, //     bLength
		0x24, //     bDescriptorType
		0x01, //     bDescriptorSubtype
		0x0C, //    bTerminalLink
		0x01, //     bDelay
		0x01, // wFormatTag   (PCM)
		0x00, // wFormatTag   (PCM)

		// AS Format Type 1 Descriptor (Speaker):
		//------------------------------
		0x0B, //    bLength
		0x24, //     bDescriptorType
		0x02, //     bDescriptorSubtype
		0x01, //     bFormatType   (FORMAT_TYPE_1)
		0x02, //     bNrChannels   (2 channels)
		0x03, //     bSubframeSize
		0x18, //     bBitResolution   (24 bits per sample)
		0x01, //     bSamFreqType   (Discrete sampling frequencies)
		0x80, //         tSamFreq(1)   (48000 Hz)
		0xBB, //         tSamFreq(1)   (48000 Hz)
		0x00, //         tSamFreq(1)   (48000 Hz)

		// Endpoint Descriptor (Audio/MIDI 1.0) (Speaker):
		//------------------------------
		0x09,					  //     bLength
		0x05,					  //     bDescriptorType
		AUDIO_OUT_EP,			  //     bEndpointAddress  (OUT endpoint 1)
		0x05,					  //     bmAttributes      (Transfer: Isochronous / Synch: Asynchronous / Usage: Data)
		LOBYTE(AUDIO_OUT_PACKET), /* wMaxPacketSize: */
		HIBYTE(AUDIO_OUT_PACKET),
		0x01, //     bInterval         (1 frames)
		0x00, //     bRefresh
		0x00, //     bSynchAddress

