witalis3/UA3REO-DDC-Transceiver/STM32/Src/usbd_ua3reo.c
		// AS Isochronous Data Endpoint Descriptor (Speaker):
		//------------------------------
		0x07, //     bLength
		0x25, //     bDescriptorType
		0x01, //     bDescriptorSubtype
		0x00, //     bmAttributes
		0x00, //     bLockDelayUnits   (undefined)
		0x00, // wLockDelay
		0x00, // wLockDelay

		//---------------------------------------------------------------------------

		// AUDIO IQ PORT
		
		// Interface Association Descriptor:
		//------------------------------
		0x08,					 //     bLength
		0x0B,					 //    bDescriptorType
		IQ_INTERFACE_IDX,					 //     bFirstInterface
		0x02,					 //     bInterfaceCount
		0x01,					 //     bFunctionClass      (Audio Device Class)
		0x00,					 //     bFunctionSubClass
		0x00,					 //     bFunctionProtocol
		USBD_IDX_INTERFACE4_STR, //     iFunction   "UA3REO Transceiver AUDIO IQ"

		// Interface Descriptor (Control):
		//------------------------------
		0x09,					 //     bLength
		0x04,					 //     bDescriptorType
		IQ_INTERFACE_IDX,	 //     bInterfaceNumber
		0x00,					 //     bAlternateSetting
		0x00,					 //     bNumEndPoints
		0x01,					 //     bInterfaceClass      (Audio Device Class)
		0x01,					 //     bInterfaceSubClass   (Audio Control Interface)
		0x00,					 //     bInterfaceProtocol
		USBD_IDX_INTERFACE4_STR, //     iInterface   ""

		// AC Interface Header Descriptor (Control):
		//------------------------------
		0x09, //     bLength
		0x24, //     bDescriptorType
		0x01, //     bDescriptorSubtype
		0x00, //
		0x01, // bcdADC
		0x1E, // wTotalLength   (30 bytes)
		0x00, // wTotalLength
		0x01, //     bInCollection
		(IQ_INTERFACE_IDX + 1), //     baInterfaceNr(1)
		
		// AC Input Terminal Descriptor (Microphone):
		//------------------------------
		0x0C, //    bLength
		0x24, //     bDescriptorType
		0x02, //     bDescriptorSubtype
		0x1F, //    bTerminalID
		0x10, // wTerminalType   (Radio Receiver)
		0x07, // wTerminalType   (Radio Receiver)
		0x00, //     bAssocTerminal
		0x02, //     bNrChannels   (2 channels)
		0x03, // wChannelConfig
		0x00, // wChannelConfig
		0x00, //    iChannelNames
		0x00, //     iTerminal

		// AC Output Terminal Descriptor (Microphone):
		//------------------------------
		0x09, //     bLength
		0x24, //     bDescriptorType
		0x03, //     bDescriptorSubtype
		0x24, //     bTerminalID
		0x01, // wTerminalType   (USB Streaming)
		0x01, // wTerminalType   (USB Streaming)
		0x00, //     bAssocTerminal
		0x1F, //    bSourceID
		0x00, //     iTerminal   "wwww 1"

		// Interface Descriptor (Microphone):
		//------------------------------
		0x09,					   //     bLength
		0x04,					   //     bDescriptorType
		(IQ_INTERFACE_IDX + 1), //     bInterfaceNumber
		0x00,					   //     bAlternateSetting
		0x00,					   //     bNumEndPoints
		0x01,					   //     bInterfaceClass      (Audio Device Class)
		0x02,					   //     bInterfaceSubClass   (Audio Streaming Interface)
		0x00,					   //     bInterfaceProtocol
		USBD_IDX_INTERFACE4_STR,   //     iInterface   "xxxx 1"

		// Interface Descriptor (Microphone):
		//------------------------------
		0x09,					   //     bLength
		0x04,					   //     bDescriptorType
		(IQ_INTERFACE_IDX + 1), //     bInterfaceNumber
		0x01,					   //     bAlternateSetting
		0x01,					   //     bNumEndPoints
		0x01,					   //     bInterfaceClass      (Audio Device Class)
		0x02,					   //     bInterfaceSubClass   (Audio Streaming Interface)
		0x00,					   //     bInterfaceProtocol
		USBD_IDX_INTERFACE4_STR,   //     iInterface   "xxxx 1"

		// AS Interface Descriptor (Microphone):
		//------------------------------
		0x07, //     bLength
		0x24, //     bDescriptorType
		0x01, //     bDescriptorSubtype
		0x24, //     bTerminalLink
		0x01, //     bDelay
		0x01, // wFormatTag   (PCM)
		0x00, // wFormatTag   (PCM)

		// AS Format Type 1 Descriptor (Microphone):
		//------------------------------
		0x0B, //    bLength
		0x24, //     bDescriptorType
		0x02, //     bDescriptorSubtype
		0x01, //     bFormatType   (FORMAT_TYPE_1)
		0x02, //     bNrChannels   (2 channels)
		0x03, //     bSubframeSize
		0x18, //     bBitResolution   (24 bits per sample)
		0x01, //     bSamFreqType   (Discrete sampling frequencies)
		0x80, //         tSamFreq(1)   (48000 Hz)
		0xBB, //         tSamFreq(1)   (48000 Hz)
		0x00, //         tSamFreq(1)   (48000 Hz)

		// Endpoint Descriptor (Audio/MIDI 1.0) (Microphone):
		//------------------------------
		0x09,					  //     bLength
		0x05,					  //     bDescriptorType
		IQ_IN_EP,			  //     bEndpointAddress  (IN endpoint 1)
		0x0D,					  //     bmAttributes      (Transfer: Isochronous / Synch: Synchronous / Usage: Data)
		LOBYTE(AUDIO_OUT_PACKET), /* wMaxPacketSize: */
		HIBYTE(AUDIO_OUT_PACKET),
		0x01, //     bInterval         (1 frames)
		0x00, //     bRefresh
		0x00, //     bSynchAddress

		// AS Isochronous Data Endpoint Descriptor (Microphone):
		//------------------------------
		0x07, //     bLength
		0x25, //     bDescriptorType
		0x01, //     bDescriptorSubtype
		0x00, //     bmAttributes
		0x02, //     bLockDelayUnits   (decoded PCM samples)
		0x00, // wLockDelay
		0x00, // wLockDelay

		//---------------------------------------------------------------------------

		// Mass Storage interface
		0x09,				   /* bLength: Interface Descriptor size */
		0x04,				   /* bDescriptorType: */
		STORAGE_INTERFACE_IDX, /* bInterfaceNumber: Number of Interface */
		0x00,				   /* bAlternateSetting: Alternate setting */
		0x02,				   /* bNumEndpoints*/
		0x08,				   /* bInterfaceClass: MSC Class */
		0x06,				   /* bInterfaceSubClass : SCSI transparent*/
		0x50,				   /* nInterfaceProtocol */
		0x05,				   /* iInterface: */
		
		/********************  Mass Storage Endpoints ********************/
		0x07,		   /* Endpoint descriptor length = 7 */
		0x05,		   /* Endpoint descriptor type */
		MSC_EPIN_ADDR, /* Endpoint address (IN, address 1) */
		0x02,		   /* Bulk endpoint type */
		LOBYTE(MSC_MAX_FS_PACKET),
		HIBYTE(MSC_MAX_FS_PACKET),
		0x00, /* Polling interval in milliseconds */

		0x07,			/* Endpoint descriptor length = 7 */
		0x05,			/* Endpoint descriptor type */
		MSC_EPOUT_ADDR, /* Endpoint address (OUT, address 1) */
		0x02,			/* Bulk endpoint type */
		LOBYTE(MSC_MAX_FS_PACKET),
		HIBYTE(MSC_MAX_FS_PACKET),
		0x00 /* Polling interval in milliseconds */
};

/**
 * @}
 */

/** @defgroup USBD_CDC_Private_Functions
 * @{
 */

/**
 * @brief  USBD_CDC_Init
 *         Initialize the CDC interface
 * @param  pdev: device instance
 * @param  cfgidx: Configuration index
 * @retval status
 */
static uint8_t USBD_UA3REO_Init(USBD_HandleTypeDef *pdev)
{
	USB_LastActiveTime = HAL_GetTick();
	uint8_t ret = 0U;
	USBD_DEBUG_HandleTypeDef *hcdc_debug;
	USBD_CAT_HandleTypeDef *hcdc_cat;
	USBD_AUDIO_HandleTypeDef *haudio;
	USBD_IQ_HandleTypeDef *haudioiq;
	USBD_MSC_BOT_HandleTypeDef *hstorage;

	/* Open EP IN */
	USBD_LL_OpenEP(pdev, DEBUG_IN_EP, USBD_EP_TYPE_BULK, CDC_DATA_FS_IN_PACKET_SIZE);
	USBD_LL_OpenEP(pdev, CAT_IN_EP, USBD_EP_TYPE_BULK, CDC_DATA_FS_IN_PACKET_SIZE);
	USBD_LL_OpenEP(pdev, AUDIO_IN_EP, USBD_EP_TYPE_ISOC, AUDIO_OUT_PACKET);
	USBD_LL_OpenEP(pdev, IQ_IN_EP, USBD_EP_TYPE_ISOC, AUDIO_OUT_PACKET);
	USBD_LL_OpenEP(pdev, MSC_EPIN_ADDR, USBD_EP_TYPE_BULK, MSC_MAX_FS_PACKET);

