witalis3/UA3REO-DDC-Transceiver/STM32/Src/usbd_ua3reo.c
	pdev->ep_in[DEBUG_IN_EP & 0xFU].is_used = 1U;
	pdev->ep_in[CAT_IN_EP & 0xFU].is_used = 1U;
	pdev->ep_in[AUDIO_IN_EP & 0xFU].is_used = 1U;
	pdev->ep_in[IQ_IN_EP & 0xFU].is_used = 1U;
	pdev->ep_in[MSC_EPIN_ADDR & 0xFU].is_used = 1U;

	/* Open EP OUT */
	USBD_LL_OpenEP(pdev, DEBUG_OUT_EP, USBD_EP_TYPE_BULK, CDC_DATA_FS_OUT_PACKET_SIZE);
	USBD_LL_OpenEP(pdev, CAT_OUT_EP, USBD_EP_TYPE_BULK, CDC_DATA_FS_OUT_PACKET_SIZE);
	USBD_LL_OpenEP(pdev, AUDIO_OUT_EP, USBD_EP_TYPE_ISOC, AUDIO_OUT_PACKET);
	USBD_LL_OpenEP(pdev, MSC_EPOUT_ADDR, USBD_EP_TYPE_BULK, MSC_MAX_FS_PACKET);

	pdev->ep_out[DEBUG_OUT_EP & 0xFU].is_used = 1U;
	pdev->ep_out[CAT_OUT_EP & 0xFU].is_used = 1U;
	pdev->ep_out[AUDIO_OUT_EP & 0xFU].is_used = 1U;
	pdev->ep_out[MSC_EPOUT_ADDR & 0xFU].is_used = 1U;

	// INT EP
	USBD_LL_OpenEP(pdev, DEBUG_CMD_EP, USBD_EP_TYPE_INTR, CDC_CMD_PACKET_SIZE);
	USBD_LL_OpenEP(pdev, CAT_CMD_EP, USBD_EP_TYPE_INTR, CDC_CMD_PACKET_SIZE);
	pdev->ep_in[DEBUG_CMD_EP & 0xFU].is_used = 1U;
	pdev->ep_in[CAT_CMD_EP & 0xFU].is_used = 1U;

	static USBD_DEBUG_HandleTypeDef pClassDataDEBUG = {0};
	static USBD_CAT_HandleTypeDef pClassDataCAT = {0};
	static USBD_AUDIO_HandleTypeDef pClassDataAUDIO = {0};
	static USBD_IQ_HandleTypeDef pClassDataIQ = {0};
	static USBD_MSC_BOT_HandleTypeDef pClassDataSTORAGE = {0};

	pdev->pClassDataDEBUG = &pClassDataDEBUG;
	dma_memset(pdev->pClassDataDEBUG, 0, sizeof(USBD_DEBUG_HandleTypeDef));
	pdev->pClassDataCAT = &pClassDataCAT;
	dma_memset(pdev->pClassDataCAT, 0, sizeof(USBD_CAT_HandleTypeDef));
	pdev->pClassDataAUDIO = &pClassDataAUDIO;
	dma_memset(pdev->pClassDataAUDIO, 0, sizeof(USBD_AUDIO_HandleTypeDef));
	pdev->pClassDataIQ = &pClassDataIQ;
	dma_memset(pdev->pClassDataIQ, 0, sizeof(USBD_IQ_HandleTypeDef));
	pdev->pClassDataSTORAGE = &pClassDataSTORAGE;
	dma_memset(pdev->pClassDataSTORAGE, 0, sizeof(USBD_MSC_BOT_HandleTypeDef));

	hcdc_debug = (USBD_DEBUG_HandleTypeDef *)pdev->pClassDataDEBUG;

	/* Init  physical Interface components */
	((USBD_DEBUG_ItfTypeDef *)pdev->pUserDataDEBUG)->Init();

	/* Init Xfer states */
	hcdc_debug->TxState = 0U;
	hcdc_debug->RxState = 0U;

	/* Prepare Out endpoint to receive next packet */
	USBD_LL_PrepareReceive(pdev, DEBUG_OUT_EP, hcdc_debug->RxBuffer, CDC_DATA_FS_OUT_PACKET_SIZE);

	hcdc_cat = (USBD_CAT_HandleTypeDef *)pdev->pClassDataCAT;

	((USBD_CAT_ItfTypeDef *)pdev->pUserDataCAT)->Init();

	hcdc_cat->TxState = 0U;
	hcdc_cat->RxState = 0U;

	USBD_LL_PrepareReceive(pdev, CAT_OUT_EP, hcdc_cat->RxBuffer, CDC_DATA_FS_OUT_PACKET_SIZE);

	// Initialize the Audio output Hardware layer

	haudio = (USBD_AUDIO_HandleTypeDef *)pdev->pClassDataAUDIO;
	haudio->alt_setting = 0U;

	if (((USBD_AUDIO_ItfTypeDef *)pdev->pUserDataAUDIO)->Init() != 0)
	{
		return USBD_FAIL;
	}
	
	haudioiq = (USBD_IQ_HandleTypeDef *)pdev->pClassDataIQ;
	haudioiq->alt_setting = 0U;
	
	if (((USBD_IQ_ItfTypeDef *)pdev->pUserDataIQ)->Init() != 0)
	{
		return USBD_FAIL;
	}

	//MSC
	
	MSC_BOT_Init(pdev);

	return ret;
}

/**
 * @brief  USBD_CDC_Init
 *         DeInitialize the CDC layer
 * @param  pdev: device instance
 * @param  cfgidx: Configuration index
 * @retval status
 */
static uint8_t USBD_UA3REO_DeInit(USBD_HandleTypeDef *pdev)
{
	uint8_t ret = 0U;

	/* Close EP IN */
	USBD_LL_CloseEP(pdev, DEBUG_IN_EP);
	USBD_LL_CloseEP(pdev, CAT_IN_EP);
	USBD_LL_CloseEP(pdev, AUDIO_IN_EP);
	USBD_LL_CloseEP(pdev, IQ_IN_EP);
	USBD_LL_CloseEP(pdev, MSC_EPIN_ADDR);
	pdev->ep_in[DEBUG_IN_EP & 0xFU].is_used = 0U;
	pdev->ep_in[CAT_IN_EP & 0xFU].is_used = 0U;
	pdev->ep_in[AUDIO_IN_EP & 0xFU].is_used = 0U;
	pdev->ep_in[IQ_IN_EP & 0xFU].is_used = 0U;
	pdev->ep_in[MSC_EPIN_ADDR & 0xFU].is_used = 0U;

	/* Close EP OUT */
	USBD_LL_CloseEP(pdev, DEBUG_OUT_EP);
	USBD_LL_CloseEP(pdev, CAT_OUT_EP);
	USBD_LL_CloseEP(pdev, AUDIO_OUT_EP);
	USBD_LL_CloseEP(pdev, MSC_EPOUT_ADDR);
	pdev->ep_out[DEBUG_OUT_EP & 0xFU].is_used = 0U;
	pdev->ep_out[CAT_OUT_EP & 0xFU].is_used = 0U;
	pdev->ep_out[AUDIO_OUT_EP & 0xFU].is_used = 0U;
	pdev->ep_out[MSC_EPOUT_ADDR & 0xFU].is_used = 0U;

	// CLOSE INT EP
	USBD_LL_CloseEP(pdev, DEBUG_CMD_EP);
	USBD_LL_CloseEP(pdev, CAT_CMD_EP);
	pdev->ep_in[DEBUG_CMD_EP & 0xFU].is_used = 0U;
	pdev->ep_in[CAT_CMD_EP & 0xFU].is_used = 0U;

	/* DeInit  physical Interface components */
	if (pdev->pClassDataDEBUG != NULL)
	{
		((USBD_DEBUG_ItfTypeDef *)pdev->pUserDataDEBUG)->DeInit();
		pdev->pClassDataDEBUG = NULL;
	}
	if (pdev->pClassDataCAT != NULL)
	{
		((USBD_CAT_ItfTypeDef *)pdev->pUserDataCAT)->DeInit();
		pdev->pClassDataCAT = NULL;
	}
	if (pdev->pClassDataAUDIO != NULL)
	{
		((USBD_AUDIO_ItfTypeDef *)pdev->pUserDataAUDIO)->DeInit();
		pdev->pClassDataAUDIO = NULL;
	}
	if (pdev->pClassDataIQ != NULL)
	{
		((USBD_IQ_ItfTypeDef *)pdev->pUserDataIQ)->DeInit();
		pdev->pClassDataIQ = NULL;
	}
	if (pdev->pClassDataSTORAGE != NULL)
	{
		MSC_BOT_DeInit(pdev);
		pdev->pClassDataSTORAGE = NULL;
	}
	return ret;
}

/**
 * @brief  USBD_CDC_Setup
 *         Handle the CDC specific requests
 * @param  pdev: instance
 * @param  req: usb requests
 * @retval status
 */
static uint8_t USBD_DEBUG_Setup(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
	USB_LastActiveTime = HAL_GetTick();
	USBD_DEBUG_HandleTypeDef *hcdc_debug = (USBD_DEBUG_HandleTypeDef *)pdev->pClassDataDEBUG;
	uint8_t ifalt = 0U;
	uint16_t status_info = 0U;
	uint8_t ret = USBD_OK;

	switch (req->bmRequest & USB_REQ_TYPE_MASK)
	{
	case USB_REQ_TYPE_CLASS:
		if (req->wLength)
		{
			if (req->bmRequest & 0x80U)
			{
				((USBD_DEBUG_ItfTypeDef *)pdev->pUserDataDEBUG)->Control(req->bRequest, (uint8_t *)(void *)hcdc_debug->data, req->wLength);
				USBD_CtlSendData(pdev, (uint8_t *)(void *)hcdc_debug->data, req->wLength);
			}
			else
			{
				hcdc_debug->CmdOpCode = req->bRequest;
				hcdc_debug->CmdLength = (uint8_t)req->wLength;
				USBD_CtlPrepareRx(pdev, (uint8_t *)(void *)hcdc_debug->data, req->wLength);
			}
		}
		else
		{
			((USBD_DEBUG_ItfTypeDef *)pdev->pUserDataDEBUG)->Control(req->bRequest, (uint8_t *)(void *)req, req->wLength);
		}
		break;

	case USB_REQ_TYPE_STANDARD:
		switch (req->bRequest)
		{
		case USB_REQ_GET_STATUS:
			if (pdev->dev_state == USBD_STATE_CONFIGURED)
			{
				USBD_CtlSendData(pdev, (uint8_t *)(void *)&status_info, 2U);
			}
			else
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		case USB_REQ_GET_INTERFACE:
			if (pdev->dev_state == USBD_STATE_CONFIGURED)
			{
				USBD_CtlSendData(pdev, &ifalt, 1U);
			}
			else
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		case USB_REQ_SET_INTERFACE:
			if (pdev->dev_state != USBD_STATE_CONFIGURED)
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		default:
			USBD_CtlError(pdev);
			ret = USBD_FAIL;
			break;
		}
		break;

	default:
		USBD_CtlError(pdev);
		ret = USBD_FAIL;
		break;
	}
	return ret;
}

static uint8_t USBD_CAT_Setup(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
	USBD_CAT_HandleTypeDef *hcdc_cat = (USBD_CAT_HandleTypeDef *)pdev->pClassDataCAT;
	uint8_t ifalt = 0U;
	uint16_t status_info = 0U;
	uint8_t ret = USBD_OK;

