witalis3/UA3REO-DDC-Transceiver/STM32/Src/usbd_ua3reo.c
	switch (req->bmRequest & USB_REQ_TYPE_MASK)
	{
	case USB_REQ_TYPE_CLASS:
		if (req->wLength)
		{
			if (req->bmRequest & 0x80U)
			{
				((USBD_CAT_ItfTypeDef *)pdev->pUserDataCAT)->Control(req->bRequest, (uint8_t *)(void *)hcdc_cat->data);
				USBD_CtlSendData(pdev, (uint8_t *)(void *)hcdc_cat->data, req->wLength);
			}
			else
			{
				hcdc_cat->CmdOpCode = req->bRequest;
				hcdc_cat->CmdLength = (uint8_t)req->wLength;
				USBD_CtlPrepareRx(pdev, (uint8_t *)(void *)hcdc_cat->data, req->wLength);
			}
		}
		else
		{
			((USBD_CAT_ItfTypeDef *)pdev->pUserDataCAT)->Control(req->bRequest, (uint8_t *)(void *)req);
		}
		break;

	case USB_REQ_TYPE_STANDARD:
		switch (req->bRequest)
		{
		case USB_REQ_GET_STATUS:
			if (pdev->dev_state == USBD_STATE_CONFIGURED)
			{
				USBD_CtlSendData(pdev, (uint8_t *)(void *)&status_info, 2U);
			}
			else
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		case USB_REQ_GET_INTERFACE:
			if (pdev->dev_state == USBD_STATE_CONFIGURED)
			{
				USBD_CtlSendData(pdev, &ifalt, 1U);
			}
			else
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		case USB_REQ_SET_INTERFACE:
			if (pdev->dev_state != USBD_STATE_CONFIGURED)
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		default:
			USBD_CtlError(pdev);
			ret = USBD_FAIL;
			break;
		}
		break;

	default:
		USBD_CtlError(pdev);
		ret = USBD_FAIL;
		break;
	}
	return ret;
}

static uint8_t USBD_AUDIO_Setup(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
	USBD_AUDIO_HandleTypeDef *haudio;
	uint16_t status_info = 0U;
	uint8_t ret = USBD_OK;

	haudio = (USBD_AUDIO_HandleTypeDef *)pdev->pClassDataAUDIO;

	switch (req->bmRequest & USB_REQ_TYPE_MASK)
	{
	case USB_REQ_TYPE_CLASS:
		switch (req->bRequest)
		{
		case AUDIO_REQ_GET_CUR:
			AUDIO_REQ_GetCurrent(pdev, req);
			break;

		case AUDIO_REQ_SET_CUR:
			AUDIO_REQ_SetCurrent(pdev, req);
			break;

		default:
			USBD_CtlError(pdev);
			ret = USBD_FAIL;
			break;
		}
		break;

	case USB_REQ_TYPE_STANDARD:
		switch (req->bRequest)
		{
		case USB_REQ_GET_STATUS:
			if (pdev->dev_state == USBD_STATE_CONFIGURED)
			{
				USBD_CtlSendData(pdev, (uint8_t *)(void *)&status_info, 2U);
			}
			else
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		case USB_REQ_GET_DESCRIPTOR:
			if ((req->wValue >> 8) == AUDIO_DESCRIPTOR_TYPE)
			{
				// pbuf = USBD_AUDIO_CfgDesc + 18;
				// len = MIN(USB_AUDIO_DESC_SIZ , req->wLength);
				// USBD_CtlSendData (pdev, pbuf, len);
			}
			break;

		case USB_REQ_GET_INTERFACE:
			if (pdev->dev_state == USBD_STATE_CONFIGURED)
			{
				USBD_CtlSendData(pdev, (uint8_t *)(void *)&haudio->alt_setting, 1U);
			}
			else
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		case USB_REQ_SET_INTERFACE:
			if (pdev->dev_state == USBD_STATE_CONFIGURED)
			{
				if ((uint8_t)(req->wValue) <= USBD_MAX_NUM_INTERFACES)
				{
					haudio->alt_setting = (uint8_t)(req->wValue);
				}
				else
				{
					/* Call the error management function (command will be nacked */
					USBD_CtlError(pdev);
					ret = USBD_FAIL;
				}
			}
			else
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		default:
			USBD_CtlError(pdev);
			ret = USBD_FAIL;
			break;
		}
		break;
	default:
		USBD_CtlError(pdev);
		ret = USBD_FAIL;
		break;
	}
	return ret;
}

static uint8_t USBD_IQ_Setup(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
	USBD_IQ_HandleTypeDef *haudio;
	uint16_t status_info = 0U;
	uint8_t ret = USBD_OK;

	haudio = (USBD_IQ_HandleTypeDef *)pdev->pClassDataIQ;

	switch (req->bmRequest & USB_REQ_TYPE_MASK)
	{
	case USB_REQ_TYPE_CLASS:
		switch (req->bRequest)
		{
		case AUDIO_REQ_GET_CUR:
			IQ_REQ_GetCurrent(pdev, req);
			break;

		case AUDIO_REQ_SET_CUR:
			IQ_REQ_SetCurrent(pdev, req);
			break;

		default:
			USBD_CtlError(pdev);
			ret = USBD_FAIL;
			break;
		}
		break;

	case USB_REQ_TYPE_STANDARD:
		switch (req->bRequest)
		{
		case USB_REQ_GET_STATUS:
			if (pdev->dev_state == USBD_STATE_CONFIGURED)
			{
				USBD_CtlSendData(pdev, (uint8_t *)(void *)&status_info, 2U);
			}
			else
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		case USB_REQ_GET_DESCRIPTOR:
			if ((req->wValue >> 8) == AUDIO_DESCRIPTOR_TYPE)
			{
				// pbuf = USBD_AUDIO_CfgDesc + 18;
				// len = MIN(USB_AUDIO_DESC_SIZ , req->wLength);
				// USBD_CtlSendData (pdev, pbuf, len);
			}
			break;

		case USB_REQ_GET_INTERFACE:
			if (pdev->dev_state == USBD_STATE_CONFIGURED)
			{
				USBD_CtlSendData(pdev, (uint8_t *)(void *)&haudio->alt_setting, 1U);
			}
			else
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		case USB_REQ_SET_INTERFACE:
			if (pdev->dev_state == USBD_STATE_CONFIGURED)
			{
				if ((uint8_t)(req->wValue) <= USBD_MAX_NUM_INTERFACES)
				{
					haudio->alt_setting = (uint8_t)(req->wValue);
				}
				else
				{
					/* Call the error management function (command will be nacked */
					USBD_CtlError(pdev);
					ret = USBD_FAIL;
				}
			}
			else
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		default:
			USBD_CtlError(pdev);
			ret = USBD_FAIL;
			break;
		}
		break;
	default:
		USBD_CtlError(pdev);
		ret = USBD_FAIL;
		break;
	}
	return ret;
}

uint8_t USBD_MSC_Setup(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
	USBD_MSC_BOT_HandleTypeDef *hmsc = (USBD_MSC_BOT_HandleTypeDef *)pdev->pClassDataSTORAGE;
	USBD_StatusTypeDef ret = USBD_OK;
	uint16_t status_info = 0U;

	switch (req->bmRequest & USB_REQ_TYPE_MASK)
	{
		/* Class request */
	case USB_REQ_TYPE_CLASS:
		switch (req->bRequest)
		{
		case BOT_GET_MAX_LUN:
			if ((req->wValue == 0U) && (req->wLength == 1U) && ((req->bmRequest & 0x80U) == 0x80U))
			{
				hmsc->max_lun = (uint32_t)((USBD_StorageTypeDef *)pdev->pUserDataSTORAGE)->GetMaxLun();
				(void)USBD_CtlSendData(pdev, (uint8_t *)&hmsc->max_lun, 1U);
			}
			else
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		case BOT_RESET:
			if ((req->wValue == 0U) && (req->wLength == 0U) && ((req->bmRequest & 0x80U) != 0x80U))
			{
				MSC_BOT_Reset(pdev);
			}
			else
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		default:
			USBD_CtlError(pdev);
			ret = USBD_FAIL;
			break;
		}
		break;
		/* Interface & Endpoint request */
	case USB_REQ_TYPE_STANDARD:
		switch (req->bRequest)
		{
		case USB_REQ_GET_STATUS:
			if (pdev->dev_state == USBD_STATE_CONFIGURED)
			{
				(void)USBD_CtlSendData(pdev, (uint8_t *)&status_info, 2U);
			}
			else
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		case USB_REQ_GET_INTERFACE:
			if (pdev->dev_state == USBD_STATE_CONFIGURED)
			{
				(void)USBD_CtlSendData(pdev, (uint8_t *)&hmsc->interface, 1U);
			}
			else
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		case USB_REQ_SET_INTERFACE:
			if (pdev->dev_state == USBD_STATE_CONFIGURED)
			{
				hmsc->interface = (uint8_t)(req->wValue);
			}
			else
			{
				USBD_CtlError(pdev);
				ret = USBD_FAIL;
			}
			break;

		case USB_REQ_CLEAR_FEATURE:
			if (pdev->dev_state == USBD_STATE_CONFIGURED)
			{
				if (req->wValue == USB_FEATURE_EP_HALT)
				{
					/* Flush the FIFO */
					(void)USBD_LL_FlushEP(pdev, (uint8_t)req->wIndex);

					/* Handle BOT error */
					MSC_BOT_CplClrFeature(pdev, (uint8_t)req->wIndex);
				}
			}
			break;

		default:
			USBD_CtlError(pdev);
			ret = USBD_FAIL;
			break;
		}
		break;

	default:
		USBD_CtlError(pdev);
		ret = USBD_FAIL;
		break;
	}

	return (uint8_t)ret;
}

static uint8_t USBD_UA3REO_Setup(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
	USB_LastActiveTime = HAL_GetTick();
	uint8_t ret = 0;
	// Route requests to MSC interface or its endpoints to MSC class implementaion
	if (((req->bmRequest & USB_REQ_RECIPIENT_MASK) == USB_REQ_RECIPIENT_INTERFACE && req->wIndex == DEBUG_INTERFACE_IDX) ||
		((req->bmRequest & USB_REQ_RECIPIENT_MASK) == USB_REQ_RECIPIENT_ENDPOINT && ((req->wIndex & 0x7F) == DEBUG_EP_IDX)))
	{
		ret = USBD_DEBUG_Setup(pdev, req);
	}
	else if (((req->bmRequest & USB_REQ_RECIPIENT_MASK) == USB_REQ_RECIPIENT_INTERFACE && req->wIndex == AUDIO_INTERFACE_IDX) ||
			 ((req->bmRequest & USB_REQ_RECIPIENT_MASK) == USB_REQ_RECIPIENT_ENDPOINT && ((req->wIndex & 0x7F) == AUDIO_EP_IDX)))
	{
		ret = USBD_AUDIO_Setup(pdev, req);
	}
	else if (((req->bmRequest & USB_REQ_RECIPIENT_MASK) == USB_REQ_RECIPIENT_INTERFACE && req->wIndex == IQ_INTERFACE_IDX) ||
			 ((req->bmRequest & USB_REQ_RECIPIENT_MASK) == USB_REQ_RECIPIENT_ENDPOINT && ((req->wIndex & 0x7F) == IQ_EP_IDX)))
	{
		ret = USBD_IQ_Setup(pdev, req);
	}
	else if (((req->bmRequest & USB_REQ_RECIPIENT_MASK) == USB_REQ_RECIPIENT_INTERFACE && req->wIndex == STORAGE_INTERFACE_IDX) ||
			 ((req->bmRequest & USB_REQ_RECIPIENT_MASK) == USB_REQ_RECIPIENT_ENDPOINT && ((req->wIndex & 0x7F) == STORAGE_EP_IDX)))
	{
		ret = USBD_MSC_Setup(pdev, req);
	}
	else
		ret = USBD_CAT_Setup(pdev, req);
	return ret;
}

/**
 * @brief  USBD_CDC_DataIn
 *         Data sent on non-control IN endpoint
 * @param  pdev: device instance
 * @param  epnum: endpoint number
 * @retval status
 */
static uint8_t USBD_DEBUG_DataIn(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
	USBD_DEBUG_HandleTypeDef *hcdc_debug = (USBD_DEBUG_HandleTypeDef *)pdev->pClassDataDEBUG;
	PCD_HandleTypeDef *hpcd_debug = pdev->pUserDataDEBUG;

	if (pdev->pClassDataDEBUG != NULL)
	{
		if ((pdev->ep_in[epnum].total_length > 0U) && ((pdev->ep_in[epnum].total_length % hpcd_debug->IN_ep[epnum].maxpacket) == 0U))
		{
			/* Update the packet total length */
			pdev->ep_in[epnum].total_length = 0U;

			/* Send ZLP */
			USBD_LL_Transmit(pdev, epnum, NULL, 0U);
		}
		else
		{
			hcdc_debug->TxState = 0U;
		}
		return USBD_OK;
	}
	else
	{
		return USBD_FAIL;
	}
}

