witalis3/UA3REO-DDC-Transceiver/STM32/Src/usbd_ua3reo.c
static uint8_t USBD_CAT_DataIn(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
	USBD_CAT_HandleTypeDef *hcdc_cat = (USBD_CAT_HandleTypeDef *)pdev->pClassDataCAT;
	PCD_HandleTypeDef *hpcd_cat = pdev->pUserDataCAT;

	if (pdev->pClassDataCAT != NULL)
	{
		if ((pdev->ep_in[epnum].total_length > 0U) && ((pdev->ep_in[epnum].total_length % hpcd_cat->IN_ep[epnum].maxpacket) == 0U))
		{
			/* Update the packet total length */
			pdev->ep_in[epnum].total_length = 0U;

			/* Send ZLP */
			USBD_LL_Transmit(pdev, epnum, NULL, 0U);
		}
		else
		{
			hcdc_cat->TxState = 0U;
		}
		return USBD_OK;
	}
	else
	{
		return USBD_FAIL;
	}
}

static uint8_t USBD_AUDIO_DataIn(USBD_HandleTypeDef *pdev)
{
	// Send audio to Host
	USBD_AUDIO_HandleTypeDef *hcdc_audio = (USBD_AUDIO_HandleTypeDef *)pdev->pClassDataAUDIO;
	if (rx_audio_buffer_head >= USB_AUDIO_RX_BUFFER_SIZE)
	{
		if (USB_AUDIO_need_rx_buffer == true)
		{
			RX_USB_AUDIO_underrun = true;
		}
		else
		{
			if (USB_AUDIO_current_rx_buffer)
				hcdc_audio->RxBuffer = (uint8_t *)&USB_AUDIO_rx_buffer_b;
			else
				hcdc_audio->RxBuffer = (uint8_t *)&USB_AUDIO_rx_buffer_a;
			USB_AUDIO_current_rx_buffer = !USB_AUDIO_current_rx_buffer;
			USB_AUDIO_need_rx_buffer = true;
			rx_audio_buffer_head = 0;
		}
	}
	if ((USB_AUDIO_RX_BUFFER_SIZE - rx_audio_buffer_head) >= AUDIO_OUT_PACKET) //-V658
		rx_audio_buffer_step = AUDIO_OUT_PACKET;
	else
		rx_audio_buffer_step = (USB_AUDIO_RX_BUFFER_SIZE - rx_audio_buffer_head);

	pdev->ep_in[AUDIO_IN_EP & 0xFU].total_length = rx_audio_buffer_step;
	HAL_PCD_EP_Transmit(pdev->pData, AUDIO_IN_EP, hcdc_audio->RxBuffer + rx_audio_buffer_head, rx_audio_buffer_step);
	RX_USB_AUDIO_SAMPLES += rx_audio_buffer_step / (BYTES_IN_SAMPLE_AUDIO_OUT_PACKET * 2); // 3 byte (24 bit) * 2 channel
	rx_audio_buffer_head += rx_audio_buffer_step;

	return USBD_OK;
}

static uint8_t USBD_IQ_DataIn(USBD_HandleTypeDef *pdev)
{
	// Send iq to Host
	USBD_IQ_HandleTypeDef *hcdc_audio = (USBD_IQ_HandleTypeDef *)pdev->pClassDataIQ;
	if (rx_iq_buffer_head >= USB_AUDIO_RX_BUFFER_SIZE)
	{
		if (USB_IQ_need_rx_buffer == true)
		{
			RX_USB_AUDIO_underrun = true;
		}
		else
		{
			if (USB_IQ_current_rx_buffer)
				hcdc_audio->RxBuffer = (uint8_t *)&USB_IQ_rx_buffer_b;
			else
				hcdc_audio->RxBuffer = (uint8_t *)&USB_IQ_rx_buffer_a;
			USB_IQ_current_rx_buffer = !USB_IQ_current_rx_buffer;
			USB_IQ_need_rx_buffer = true;
			rx_iq_buffer_head = 0;
		}
	}
	if ((USB_AUDIO_RX_BUFFER_SIZE - rx_iq_buffer_head) >= AUDIO_OUT_PACKET) //-V658
		rx_iq_buffer_step = AUDIO_OUT_PACKET;
	else
		rx_iq_buffer_step = (USB_AUDIO_RX_BUFFER_SIZE - rx_iq_buffer_head);

	pdev->ep_in[IQ_IN_EP & 0xFU].total_length = rx_iq_buffer_step;
	HAL_PCD_EP_Transmit(pdev->pData, IQ_IN_EP, hcdc_audio->RxBuffer + rx_iq_buffer_head, rx_iq_buffer_step);
	RX_USB_IQ_SAMPLES += rx_iq_buffer_step / (BYTES_IN_SAMPLE_AUDIO_OUT_PACKET * 2); // 3 byte (24 bit) * 2 channel
	rx_iq_buffer_head += rx_iq_buffer_step;

	return USBD_OK;
}

uint8_t USBD_MSC_DataIn(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
	MSC_BOT_DataIn(pdev, epnum);

	return (uint8_t)USBD_OK;
}

static uint8_t USBD_UA3REO_DataIn(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
	if (epnum == AUDIO_EP_IDX)
		return USBD_AUDIO_DataIn(pdev);
	if (epnum == IQ_EP_IDX)
		return USBD_IQ_DataIn(pdev);
	if (epnum == DEBUG_EP_IDX)
		return USBD_DEBUG_DataIn(pdev, epnum);
	if (epnum == CAT_EP_IDX)
		return USBD_CAT_DataIn(pdev, epnum);
	if (epnum == STORAGE_EP_IDX)
		return USBD_MSC_DataIn(pdev, epnum);
	return USBD_FAIL;
}
/**
 * @brief  USBD_CDC_DataOut
 *         Data received on non-control Out endpoint
 * @param  pdev: device instance
 * @param  epnum: endpoint number
 * @retval status
 */
static uint8_t USBD_DEBUG_DataOut(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
	USB_LastActiveTime = HAL_GetTick();
	USBD_DEBUG_HandleTypeDef *hcdc_debug = (USBD_DEBUG_HandleTypeDef *)pdev->pClassDataDEBUG;
	/* Get the received data length */
	hcdc_debug->RxLength = USBD_LL_GetRxDataSize(pdev, epnum);
	/* USB data will be immediately processed, this allow next USB traffic being NAKed till the end of the application Xfer */
	if (pdev->pClassDataDEBUG != NULL)
	{
		((USBD_DEBUG_ItfTypeDef *)pdev->pUserDataDEBUG)->Receive(hcdc_debug->RxBuffer);
		return USBD_OK;
	}
	else
	{
		return USBD_FAIL;
	}
}

static uint8_t USBD_CAT_DataOut(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
	USB_LastActiveTime = HAL_GetTick();
	USBD_CAT_HandleTypeDef *hcdc_cat = (USBD_CAT_HandleTypeDef *)pdev->pClassDataCAT;
	/* Get the received data length */
	hcdc_cat->RxLength = USBD_LL_GetRxDataSize(pdev, epnum);
	/* USB data will be immediately processed, this allow next USB traffic being
	NAKed till the end of the application Xfer */
	if (pdev->pClassDataCAT != NULL)
	{
		((USBD_CAT_ItfTypeDef *)pdev->pUserDataCAT)->Receive(hcdc_cat->RxBuffer, &hcdc_cat->RxLength);
		return USBD_OK;
	}
	else
	{
		return USBD_FAIL;
	}
}

static uint8_t USBD_AUDIO_DataOut(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
	USB_LastActiveTime = HAL_GetTick();
	USBD_AUDIO_HandleTypeDef *haudio = (USBD_AUDIO_HandleTypeDef *)pdev->pClassDataAUDIO;
	if (epnum == AUDIO_OUT_EP)
	{
		haudio->TxBufferIndex += AUDIO_OUT_PACKET;
		if (haudio->TxBufferIndex > (USB_AUDIO_TX_BUFFER_SIZE - AUDIO_OUT_PACKET))
			haudio->TxBufferIndex = 0;
		USBD_LL_PrepareReceive(pdev, AUDIO_OUT_EP, haudio->TxBuffer + haudio->TxBufferIndex, AUDIO_OUT_PACKET);
		TX_USB_AUDIO_SAMPLES += AUDIO_OUT_PACKET / (BYTES_IN_SAMPLE_AUDIO_OUT_PACKET * 2); // 3 byte (24 bit) * 2 channel
	}
	return USBD_OK;
}

uint8_t USBD_MSC_DataOut(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
	MSC_BOT_DataOut(pdev, epnum);

	return (uint8_t)USBD_OK;
}

static uint8_t USBD_UA3REO_DataOut(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
	if (epnum == DEBUG_EP_IDX)
		return USBD_DEBUG_DataOut(pdev, epnum);
	if (epnum == CAT_EP_IDX)
		return USBD_CAT_DataOut(pdev, epnum);
	if (epnum == AUDIO_EP_IDX)
		return USBD_AUDIO_DataOut(pdev, epnum);
	if (epnum == STORAGE_EP_IDX)
		return USBD_MSC_DataOut(pdev, epnum);
	return USBD_FAIL;
}

/**
 * @brief  USBD_CDC_EP0_RxReady
 *         Handle EP0 Rx Ready event
 * @param  pdev: device instance
 * @retval status
 */

static uint8_t USBD_UA3REO_EP0_RxReady(USBD_HandleTypeDef *pdev)
{
	USB_LastActiveTime = HAL_GetTick();
	USBD_DEBUG_HandleTypeDef *hcdc_debug = (USBD_DEBUG_HandleTypeDef *)pdev->pClassDataDEBUG;
	USBD_CAT_HandleTypeDef *hcdc_cat = (USBD_CAT_HandleTypeDef *)pdev->pClassDataCAT;
	// DEBUG
	if ((pdev->pUserDataDEBUG != NULL) && (hcdc_debug->CmdOpCode != 0xFFU))
	{
		((USBD_DEBUG_ItfTypeDef *)pdev->pUserDataDEBUG)->Control(hcdc_debug->CmdOpCode, (uint8_t *)(void *)hcdc_debug->data, 0);
		hcdc_debug->CmdOpCode = 0xFFU;
	}
	// CAT
	if ((pdev->pUserDataCAT != NULL) && (hcdc_cat->CmdOpCode != 0xFFU))
	{
		((USBD_CAT_ItfTypeDef *)pdev->pUserDataCAT)->Control(hcdc_cat->CmdOpCode, (uint8_t *)(void *)hcdc_cat->data);
		hcdc_cat->CmdOpCode = 0xFFU;
	}
	// AUDIO
	USBD_AUDIO_HandleTypeDef *haudio;
	haudio = (USBD_AUDIO_HandleTypeDef *)pdev->pClassDataAUDIO;

