witalis3/UA3REO-DDC-Transceiver/STM32/Src/usbd_ua3reo.c
	if (haudio->control.cmd == AUDIO_REQ_SET_CUR)
	{
		if (haudio->control.unit == AUDIO_OUT_STREAMING_CTRL)
		{
			haudio->control.cmd = 0U;
			haudio->control.len = 0U;
		}
	}
	
	// IQ
	USBD_IQ_HandleTypeDef *haudioiq;
	haudioiq = (USBD_IQ_HandleTypeDef *)pdev->pClassDataIQ;
	
	return USBD_OK;
}

static uint8_t USBD_UA3REO_EP0_TxReady(void)
{
	/* Only OUT control data are processed */
	return USBD_OK;
}

static uint8_t USBD_UA3REO_IsoINIncomplete(void)
{
	return USBD_OK;
}

static uint8_t USBD_UA3REO_IsoOutIncomplete(void)
{
	return USBD_OK;
}

/**
 * @brief  USBD_CDC_GetFSCfgDesc
 *         Return configuration descriptor
 * @param  speed : current device speed
 * @param  length : pointer data length
 * @retval pointer to descriptor buffer
 */
static const uint8_t *USBD_UA3REO_GetFSCfgDesc(uint16_t *length)
{
	*length = sizeof(USBD_UA3REO_CfgFSDesc);
	return USBD_UA3REO_CfgFSDesc;
}

/**
 * @brief  DeviceQualifierDescriptor
 *         return Device Qualifier descriptor
 * @param  length : pointer data length
 * @retval pointer to descriptor buffer
 */
static const uint8_t *USBD_UA3REO_GetDeviceQualifierDescriptor(uint16_t *length)
{
	*length = sizeof(USBD_UA3REO_DeviceQualifierDesc);
	return USBD_UA3REO_DeviceQualifierDesc;
}

/**
 * @brief  USBD_CDC_RegisterInterface
 * @param  pdev: device instance
 * @param  fops: CD  Interface callback
 * @retval status
 */
uint8_t USBD_DEBUG_RegisterInterface(USBD_HandleTypeDef *pdev, USBD_DEBUG_ItfTypeDef *fops)
{
	uint8_t ret = USBD_FAIL;
	if (fops != NULL)
	{
		pdev->pUserDataDEBUG = fops;
		ret = USBD_OK;
	}
	return ret;
}

uint8_t USBD_CAT_RegisterInterface(USBD_HandleTypeDef *pdev, USBD_CAT_ItfTypeDef *fops)
{
	uint8_t ret = USBD_FAIL;
	if (fops != NULL)
	{
		pdev->pUserDataCAT = fops;
		ret = USBD_OK;
	}
	return ret;
}

uint8_t USBD_AUDIO_RegisterInterface(USBD_HandleTypeDef *pdev, USBD_AUDIO_ItfTypeDef *fops)
{
	if (fops != NULL)
	{
		pdev->pUserDataAUDIO = fops;
	}
	return USBD_OK;
}

uint8_t USBD_IQ_RegisterInterface(USBD_HandleTypeDef *pdev, USBD_IQ_ItfTypeDef *fops)
{
	if (fops != NULL)
	{
		pdev->pUserDataIQ = fops;
	}
	return USBD_OK;
}

/**
 * @brief  USBD_CDC_SetTxBuffer
 * @param  pdev: device instance
 * @param  pbuff: Tx Buffer
 * @retval status
 */
uint8_t USBD_DEBUG_SetTxBuffer(USBD_HandleTypeDef *pdev, uint8_t *pbuff, uint16_t length)
{
	USBD_DEBUG_HandleTypeDef *hcdc = (USBD_DEBUG_HandleTypeDef *)pdev->pClassDataDEBUG;
	hcdc->TxBuffer = pbuff;
	hcdc->TxLength = length;
	return USBD_OK;
}

uint8_t USBD_CAT_SetTxBuffer(USBD_HandleTypeDef *pdev, uint8_t *pbuff, uint16_t length)
{
	USBD_CAT_HandleTypeDef *hcdc = (USBD_CAT_HandleTypeDef *)pdev->pClassDataCAT;
	hcdc->TxBuffer = pbuff;
	hcdc->TxLength = length;
	return USBD_OK;
}

/**
 * @brief  USBD_CDC_SetRxBuffer
 * @param  pdev: device instance
 * @param  pbuff: Rx Buffer
 * @retval status
 */
uint8_t USBD_DEBUG_SetRxBuffer(USBD_HandleTypeDef *pdev, uint8_t *pbuff)
{
	USBD_DEBUG_HandleTypeDef *hcdc = (USBD_DEBUG_HandleTypeDef *)pdev->pClassDataDEBUG;
	hcdc->RxBuffer = pbuff;
	return USBD_OK;
}

uint8_t USBD_CAT_SetRxBuffer(USBD_HandleTypeDef *pdev, uint8_t *pbuff)
{
	USBD_CAT_HandleTypeDef *hcdc = (USBD_CAT_HandleTypeDef *)pdev->pClassDataCAT;
	hcdc->RxBuffer = pbuff;
	return USBD_OK;
}

/**
 * @brief  USBD_CDC_TransmitPacket
 *         Transmit packet on IN endpoint
 * @param  pdev: device instance
 * @retval status
 */
uint8_t USBD_DEBUG_TransmitPacket(USBD_HandleTypeDef *pdev)
{
	USBD_DEBUG_HandleTypeDef *hcdc = (USBD_DEBUG_HandleTypeDef *)pdev->pClassDataDEBUG;
	if (pdev->pClassDataDEBUG != NULL)
	{
		if (hcdc->TxState == 0U)
		{
			/* Tx Transfer in progress */
			hcdc->TxState = 1U;
			/* Update the packet total length */
			pdev->ep_in[DEBUG_IN_EP & 0xFU].total_length = hcdc->TxLength;
			/* Transmit next packet */
			USBD_LL_Transmit(pdev, DEBUG_IN_EP, hcdc->TxBuffer, (uint16_t)hcdc->TxLength);
			return USBD_OK;
		}
		else
		{
			return USBD_BUSY;
		}
	}
	else
	{
		return USBD_FAIL;
	}
}

uint8_t USBD_CAT_TransmitPacket(USBD_HandleTypeDef *pdev)
{
	USBD_CAT_HandleTypeDef *hcdc = (USBD_CAT_HandleTypeDef *)pdev->pClassDataCAT;
	if (pdev->pClassDataCAT != NULL)
	{
		if (hcdc->TxState == 0U)
		{
			hcdc->TxState = 1U;
			pdev->ep_in[CAT_IN_EP & 0xFU].total_length = hcdc->TxLength;
			USBD_LL_Transmit(pdev, CAT_IN_EP, hcdc->TxBuffer, (uint16_t)hcdc->TxLength);
			return USBD_OK;
		}
		else
		{
			return USBD_BUSY;
		}
	}
	else
	{
		return USBD_FAIL;
	}
}

uint8_t USBD_AUDIO_StartTransmit(USBD_HandleTypeDef *pdev)
{
	if (pdev->pClassDataAUDIO != NULL)
	{
		println("[OK] Start Send USB Audio");
		
		USBD_AUDIO_DataIn(pdev);
		return USBD_OK;
	}
	else
	{
		return USBD_FAIL;
	}
}

uint8_t USBD_IQ_StartTransmit(USBD_HandleTypeDef *pdev)
{
	if (pdev->pClassDataIQ != NULL)
	{
		println("[OK] Start Send USB IQ");
		
		USBD_IQ_DataIn(pdev);
		return USBD_OK;
	}
	else
	{
		return USBD_FAIL;
	}
}

uint8_t USBD_AUDIO_StartReceive(USBD_HandleTypeDef *pdev)
{
	USBD_AUDIO_HandleTypeDef *haudio = (USBD_AUDIO_HandleTypeDef *)pdev->pClassDataAUDIO;
	if (pdev->pClassDataAUDIO != NULL)
	{
		println("[OK] Start Receive USB Audio");
		USBD_LL_PrepareReceive(pdev, AUDIO_OUT_EP, haudio->TxBuffer + haudio->TxBufferIndex, AUDIO_OUT_PACKET);
		return USBD_OK;
	}
	else
	{
		return USBD_FAIL;
	}
}

/**
 * @brief  USBD_CDC_ReceivePacket
 *         prepare OUT Endpoint for reception
 * @param  pdev: device instance
 * @retval status
 */
uint8_t USBD_DEBUG_ReceivePacket(USBD_HandleTypeDef *pdev)
{
	USBD_DEBUG_HandleTypeDef *hcdc = (USBD_DEBUG_HandleTypeDef *)pdev->pClassDataDEBUG;
	/* Suspend or Resume USB Out process */
	if (pdev->pClassDataDEBUG != NULL)
	{
		/* Prepare Out endpoint to receive next packet */
		USBD_LL_PrepareReceive(pdev, DEBUG_OUT_EP, hcdc->RxBuffer, CDC_DATA_FS_OUT_PACKET_SIZE);
		return USBD_OK;
	}
	else
	{
		return USBD_FAIL;
	}
}

uint8_t USBD_CAT_ReceivePacket(USBD_HandleTypeDef *pdev)
{
	USBD_CAT_HandleTypeDef *hcdc = (USBD_CAT_HandleTypeDef *)pdev->pClassDataCAT;
	/* Suspend or Resume USB Out process */
	if (pdev->pClassDataCAT != NULL)
	{
		/* Prepare Out endpoint to receive next packet */
		USBD_LL_PrepareReceive(pdev, CAT_OUT_EP, hcdc->RxBuffer, CDC_DATA_FS_OUT_PACKET_SIZE);
		return USBD_OK;
	}
	else
	{
		return USBD_FAIL;
	}
}

