witalis3/UA3REO-DDC-Transceiver/STM32/Src/usbd_ua3reo.c
static void AUDIO_REQ_GetCurrent(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
	USBD_AUDIO_HandleTypeDef *haudio;
	haudio = (USBD_AUDIO_HandleTypeDef *)pdev->pClassDataAUDIO;

	dma_memset(haudio->control.data, 0, sizeof(haudio->control.data));

	/* Send the current mute state */
	USBD_CtlSendData(pdev, haudio->control.data, req->wLength);
}

static void IQ_REQ_GetCurrent(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
	USBD_IQ_HandleTypeDef *haudio;
	haudio = (USBD_IQ_HandleTypeDef *)pdev->pClassDataIQ;

	dma_memset(haudio->control.data, 0, sizeof(haudio->control.data));

	/* Send the current mute state */
	USBD_CtlSendData(pdev, haudio->control.data, req->wLength);
}

/**
 * @brief  AUDIO_Req_SetCurrent
 *         Handles the SET_CUR Audio control request.
 * @param  pdev: instance
 * @param  req: setup class request
 * @retval status
 */
static void AUDIO_REQ_SetCurrent(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
	USBD_AUDIO_HandleTypeDef *haudio;
	haudio = (USBD_AUDIO_HandleTypeDef *)pdev->pClassDataAUDIO;

	if (req->wLength)
	{
		/* Prepare the reception of the buffer over EP0 */
		USBD_CtlPrepareRx(pdev,
						  haudio->control.data,
						  req->wLength);

		haudio->control.cmd = AUDIO_REQ_SET_CUR;	 /* Set the request value */
		haudio->control.len = (uint8_t)req->wLength; /* Set the request data length */
		haudio->control.unit = HIBYTE(req->wIndex);	 /* Set the request target unit */
	}
}

static void IQ_REQ_SetCurrent(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
	USBD_IQ_HandleTypeDef *haudio;
	haudio = (USBD_IQ_HandleTypeDef *)pdev->pClassDataIQ;

	if (req->wLength)
	{
		/* Prepare the reception of the buffer over EP0 */
		USBD_CtlPrepareRx(pdev,
						  haudio->control.data,
						  req->wLength);

		haudio->control.cmd = AUDIO_REQ_SET_CUR;	 /* Set the request value */
		haudio->control.len = (uint8_t)req->wLength; /* Set the request data length */
		haudio->control.unit = HIBYTE(req->wIndex);	 /* Set the request target unit */
	}
}

static uint8_t USBD_UA3REO_SOF(void)
{
	USB_LastActiveTime = HAL_GetTick();
	return USBD_OK;
}

void USBD_Restart(void)
{
	MX_USB_DevDisconnect();
	GPIO_InitTypeDef GPIO_InitStruct = {0};
	// GPIO_InitStruct.Pin = GPIO_PIN_11 | GPIO_PIN_12;
	GPIO_InitStruct.Pin = GPIO_PIN_12;
	GPIO_InitStruct.Pull = GPIO_PULLUP;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
	// HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12, GPIO_PIN_SET);
	// HAL_Delay(1000);

	MX_USB_DEVICE_Init();
	USB_LastActiveTime = HAL_GetTick();
}

/**
 * @brief  USBD_MSC_RegisterStorage
 * @param  fops: storage callback
 * @retval status
 */
uint8_t USBD_MSC_RegisterStorage(USBD_HandleTypeDef *pdev, USBD_StorageTypeDef *fops)
{
	if (fops == NULL)
	{
		return (uint8_t)USBD_FAIL;
	}

	pdev->pUserDataSTORAGE = fops;

	return (uint8_t)USBD_OK;
}
